{
  "term": "Spring",
  "year": "2004",
  "level": [
    "Undergraduate"
  ],
  "topics": [
    [
      "Humanities",
      "History",
      "History of Science and Technology"
    ],
    [
      "Engineering",
      "Computer Science"
    ],
    [
      "Humanities",
      "History",
      "Modern History"
    ]
  ],
  "legacy_uid": "23ecf843-0207-1160-e993-1cb1dc07e1b1",
  "instructors": {
    "content": [
      "daa6c4f6-c026-3bcd-127d-519e6b197b3b"
    ],
    "website": "ocw-www"
  },
  "course_image": {
    "content": "8bbb39d4-90f5-6909-d1a1-a9d1d76ae068",
    "website": "sts-035-the-history-of-computing-spring-2004"
  },
  "course_title": "The History of Computing",
  "course_description": "This course focuses on one particular aspect of the history of computing: the use of the computer as a scientific instrument. The electronic digital computer was invented to do science, and its applications range from physics to mathematics to biology to the humanities. What has been the impact of computing on the practice of science? Is the computer different from other scientific instruments? Is computer simulation a valid form of scientific experiment? Can computer models be viewed as surrogate theories? How does the computer change the way scientists approach the notions of proof, expertise, and discovery? No comprehensive history of scientific computing has yet been written. This seminar examines scientific articles, participants’ memoirs, and works by historians, sociologists, and anthropologists of science to provide multiple perspectives on the use of computers in diverse fields of physical, biological, and social sciences and the humanities. We explore how the computer transformed scientific practice, and how the culture of computing was influenced, in turn, by scientific applications.\n",
  "department_numbers": [
    "STS"
  ],
  "extra_course_numbers": "",
  "primary_course_number": "STS.035",
  "course_image_thumbnail": {
    "content": "397e97a4-43c3-491f-b6f3-dbcb76cea2b5",
    "website": "sts-035-the-history-of-computing-spring-2004"
  },
  "learning_resource_types": [
    "Written Assignments with Examples"
  ],
  "site_uid": "4aad20f3-348f-488c-97fa-2848986c7e67",
  "site_short_id": "sts.035-spring-2004",
  "site_url_path": "courses/sts-035-the-history-of-computing-spring-2004",
  "title": "Course Metadata"
}